Revit 2026 API

# SchemaCommonThumbnail Property

---

The property labeled "Thumbnail" common to all visual Asset types.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string Thumbnail { get; }
```
```vb
Public Shared ReadOnly Property Thumbnail As String
	Get
```
```cpp
public:
static property String^ Thumbnail {
	String^ get ();
}
```
```fsharp
static member Thumbnail : string with get
```

#### Property Value

String

This property is a "AssetPropertyList" of type "AssetPropertyString".

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace